// miniprogram/pages/eat/eat.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    msg: {
      title: "健康饮食建议",
      information: [{
          name: "蔬菜和水果应占据你的食物盘的一半",
        content: "健康餐盘中的这部分中食物颜色越深、种类越多就越好。土豆和炸薯条不能算作健康的蔬菜，因为它们的快速消化淀粉（即碳水化合物）成分高，这就与白面包和糖果对血糖和胰岛素的连环影响一样。在短时间看，这将导致饥饿感和暴饮暴食，从长远。来看，会导致体重增加，糖尿病和其他健康问题。", img:"https://gss0.baidu.com/7Po3dSag_xI4khGko9WTAnF6hhy/zhidao/pic/item/b7003af33a87e9506aab32b81b385343faf2b4a2.jpg"
        },
        {
          name: " 全谷物应占据你的食物盘的四分之一",
          content: "不是任何谷物全谷类包括全麦，糙米，以及用它们做的食物。例如全麦面食比白面包、白米和其他所谓的“精制谷物”对的血糖和胰岛素的影响更温和。这就是为什么健康饮食模板提到要选择全谷物食品，因为加工越少越好，同时限制精制谷物的摄入。", img:"http://www.51ttyy.com/webupload/article/image/20170309/20170309115705_84962.jpg"
        },
        {
          name: "健康来源的蛋白质应占据你你食物盘的四分之一",
          content: "选择鱼，鸡，豆类，坚果等食物，因为这些食物中含有有益的营养物质，如鱼类中含有预防心脏健康的ω-3脂肪酸，豆类含有纤维。对于大多数人来说每天一个鸡蛋是有益的（糖尿病人应该限制他们的鸡蛋的摄入量，一周三个蛋黄，蛋清就不限制了）。控制牛肉、猪肉和羊肉等肉类的摄入量，也要避免加工过的肉类食物，如：熏肉，冷切肉，热狗等食物，因为随着时间的推移，规律性的吃这些食物即使是少量的，也会增加心脏病，糖尿病和结肠癌等患病的风险。", img:"http://5b0988e595225.cdn.sohucs.com/images/20171128/f51230182a22455aa8e816a81bca6c4d.jpeg"
        },
        {
          name: "使用健康的植物油",
          content: "烹饪，做沙拉，和餐桌上尽量使用健康的植物油，如橄榄油，菜籽油，大豆油，玉米油，葵花籽油，花生油等等。限制黄油和动物油的摄入量，还要避免食用那些不健康的转化型脂肪酸，反式脂肪（加工类食品，肉类，饼干），氢化油。", img:"http://a2.att.hudong.com/66/40/01300544263318149982409194300_s.jpg"
        },
        {
          name: "喝水，咖啡和茶",
          content: "多喝水，如果你喜欢，喝茶或咖啡（不加糖或者加少许糖）也可以。限制牛奶及奶制品的摄入量——每天一至两杯，因为高摄入量会使前列腺癌或卵巢癌的风险的增大（每天疯狂和牛奶的童鞋们要注意啦）。限制果汁的摄入量——每天最多一小杯，因为果汁和那些含糖的苏打汽水一样，含糖量过高。不要喝含糖饮料，因为它们除了提供大量的热量外，没有什么营养价值。随着时间的推移，经常喝含糖饮料会导致体重增加，还增加糖尿病的风险，并可能使患心脏疾病的风险增大。", img:"http://up.1pintu.com/pic/ba/19/33/ba193388c98ae8a5053c9c4dc48e1035.jpg"
        },
        {
          name: "保持活力，坚持运动",
          content: "坚持运动，因为经常运动能很好的控制体重，另一半需要我们吃健康的饮食来满足我们的热量需求", img:"http://photocdn.sohu.com/20150214/mp2665853_1423906674374_2.jpeg"
        }
      ]
    }


    
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function() {

  }
})